samples/camel-cmis/soap.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://docs.oasis-open.org/ns/cmis/messaging/200908/" xmlns:ns1="http://docs.oasis-open.org/ns/cmis/core/200908/">
   <soapenv:Header>
      <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken 
		wsu:Id="UsernameToken-666" 
		xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:Username>test</wsse:Username>
            <wsse:Password>test</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <ns:createFolder>
         <ns:repositoryId>test</ns:repositoryId>
         <ns:properties>
	         	<ns1:propertyId propertyDefinitionId="cmis:objectTypeId">
	         		<ns1:value>cmis:folder</ns1:value>
      		</ns1:propertyId>
      		<ns1:propertyString propertyDefinitionId="cmis:name">
	               <ns1:value>firmati</ns1:value>
	          </ns1:propertyString>
         </ns:properties>
         <ns:folderId>L2Zpcm1h</ns:folderId>
      </ns:createFolder>
   </soapenv:Body>
</soapenv:Envelope>
